Autodesk.Revit.DB.View3D.SetSectionBox(Autodesk.Revit.DB.BoundingBoxXYZ)
Sets the section box for this 3D view.
boundingBoxXYZ:
The bounding box to use for the section box.  To turn off the section box, set Autodesk.Revit.DB.View3D.IsSectionBoxActive to false.
Individual bound enabled flags in the input box are ignored.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Bounding box cannot be empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Returns true if the view is not a view template.